class_name ControlPanel
extends Control
## 控制面板

## 菜单需要有
## 1.停止yoburin行动（表现为待机动画+不刷怪，如果当前有怪就把yoburin动画改为移动，镜像，把怪往右边拉，就像逃跑，点击后记得保存游戏）
## 2.更改当前yoburin属性（可以在菜单里改变yoburin属性，并恢复成默认值（最开始的yoburin属性）和读档（存档中的yoburin属性）并可以手动保存，以及修改yoburin属性存档）
## 3.更改当前怪物属性（包括一键击杀，更改目前生成的那只怪物的属性，以及修改怪物文件修改以后生成的怪物属性，以及把文件恢复成默认值）
## 4.手动刷怪（点击按钮刷怪而不是快捷键，避免不兼容其他软件）
## 5.一键复活yoburin（把yoburin拉起来，清除当前怪物）
## 6.设置礼物对应属性（一个礼物可以对应多种属性，一个属性可以接收多种礼物，一个电池等价多少属性，某个礼物直接等价多少（保证送特定礼物活动时也可以用），礼物包括送礼，连击，sc，上舰，以及大招触发条件也算）
## 7.保存游戏（保存当前ybr属性就行）
